[
  {
    "edition": 2023,
    "speakerId": "leonie-watson",
    "slug": "leonie-watson",
    "firstname": "Léonie",
    "lastname": "Watson",
    "bio": "<p>Léonie is Director of <a href='https://tetralogical.com'>TetraLogical</a>; a member of the <a href='https://www.w3.org/governance/board/'>W3C Board of Directors</a>; and co-Chair of the W3C Web Applications Working Group.</p><p>Amongst other things, Léonie is co-organiser of the <a href='https://inclusivedesign24.org'>Inclusive Design 24 (#id24)</a> conference; co-author of the <a href='https://inclusivedesignprinciples.org'>Inclusive Design Principles</a>; and mentor to young people interested in the fields of accessibility and inclusive design. She is also a Microsoft Most Valued Professional (MVP).</p><p>Léonie is often found at conferences, talking about web standards, accessibility mechanics, and pushing the boundaries of inclusive design (with existing technologies like SVG, HTML, ARIA, and JavaScript, as well as new technologies like AI and WebVR). She has also written about some of these things for Smashing magazine, SitePoint.com, and Net magazine, as well as on her own site <a href='https://tink.uk'>tink.uk</a>.</p><p>In her spare time, Léonie likes reading, cooking, drinking tequila, and dancing (although not necessarily in that order)!</p>",
    "image": "speakers/leonie_bw.jpeg",
    "twitter": "LeonieWatson",
    "mastodon": "",
    "web": "https://tink.uk",
    "title": "Director",
    "company": "TetraLogical",
    "talkId": "bag-of-spanners"
  },
  {
    "edition": 2023,
    "speakerId": "trent-willis",
    "slug": "trent-willis",
    "firstname": "Trent",
    "lastname": "Willis",
    "bio": "<p>A Florida-based web developer, Trent Willis, has over a decade of experience building complex web applications and is passionate about sharing that experience with others.</p> <p>Currently a Staff Software Engineer on Netflix’s Observability team, he has contributed to many Open Source projects during his career and has spoken at dozens of conferences on topics related to JavaScript, web development, and team culture.</p>",
    "image": "speakers/trent_bw.jpeg",
    "twitter": "trentmwillis",
    "mastodon": "",
    "web": "https://trentwillis.com",
    "title": "Staff Software Engineer",
    "company": "Netflix",
    "talkId": "testing-strategy"
  },
  {
    "edition": 2023,
    "speakerId": "martin-splitt",
    "slug": "martin-splitt",
    "firstname": "Martin",
    "lastname": "Splitt",
    "bio": "Martin does things with computers and then tells other people about the things that worked and the ones that didn't, so they can go and make new, exciting mistakes themselves.",
    "image": "speakers/martin_bw.png",
    "twitter": "g33konaut",
    "mastodon": "",
    "title": "Developer Relations Engineer",
    "company": "Google",
    "talkId": "talk2023-martin"
  },
  {
    "edition": 2023,
    "speakerId": "kenneth-rohde-christiansen",
    "slug": "kenneth-rohde-christiansen",
    "firstname": "Kenneth",
    "lastname": "Rohde Christiansen",
    "bio": "<p>Kenneth Rohde Christiansen is the principal engineer on Intel's Web Platform Engineering team. In his role, Kenneth leads multiple efforts to ensure the web platform works in Intel’s favour. To achieve this, Kenneth strives to build toward a complete application development platform, driving Windows and Chrome OS usage while exposing the full potential of its hardware capabilities to developers.</p> <p>Since joining Intel in 2011, Kenneth has shaped Intel's approach to working with external browser vendors and the web community. As a result, Intel landed specific features and optimization options in Chromium based browsers such as Google Chrome and Microsoft Edge. Some of these features and inventions have been industry-shaping, as it's the case with Progressive Web Apps, which are becoming one of the main ways to create desktop applications.</p> <p>Kenneth is a multi-term <strong>elected member of the W3C</strong> (World Wide Web Consortium) Technical Architecture Group, growing Intel’s influence inside the essential standardisation group of web platforms. In addition, he is also a Microsoft Most Values Professional in Developer Tooling and a Google Developer Expert in Web Technology.</p>",
    "image": "speakers/kenneth_bw.jpeg",
    "twitter": "kennethrohde",
    "mastodon": "",
    "title": "Principal Engineer and Web Platform Architect",
    "company": "Intel",
    "talkId": "talk2023-kenneth"
  },
  {
    "edition": 2023,
    "speakerId": "jay-phelps",
    "slug": "jay-phelps",
    "firstname": "Jay",
    "lastname": "Phelps",
    "bio": "Reactive Programming and compiler enthusiast. Jay works on the Shared Client Foundations team at Netflix. He's an <a href='https://rxjs.dev/team?group=Alumn'>RxJS core team alum</a> and creator of <a href='https://github.com/jayphelps/git-blame-someone-else'>git-blame-someone-else</a>.",
    "image": "speakers/jay_bw.jpg",
    "twitter": "_jayphelps",
    "mastodon": "",
    "title": "Software Engineer",
    "company": "Netflix",
    "talkId": "async-debugging"
  },
  {
    "edition": 2023,
    "speakerId": "anna-migas",
    "slug": "anna-migas",
    "firstname": "Anna",
    "lastname": "Migas",
    "bio": "<p>Anna works as a Lead UI Developer at Field Intelligence helping to bring healthcare the fastest emerging markets in the world. She is always trying to find ways to make people fall in love with coding and has a long history of organizing coding workshops for WebMuses and Rails Girls. In her spare time she is practicing Pilates, playing Hearthstone and traveling.</p>",
    "image": "speakers/anna_bw.jpg",
    "twitter": "szynszyliszys",
    "mastodon": "",
    "title": "Lead UI Developer",
    "company": "Field Intelligence",
    "talkId": "performance-tooling"
  },
  {
    "edition": 2023,
    "speakerId": "ben-lesh",
    "slug": "ben-lesh",
    "firstname": "Ben",
    "lastname": "Lesh",
    "bio": "<p>Ben Lesh is best known for his involvement as the technical lead for RxJS, a popular reactive programming library for JavaScript. He has worked on the Angular Team at Google and also at Netflix in the past.</p><p>Ben is a father of 3 children, and enjoys art such as drawing and painting.</p>",
    "image": "speakers/ben_bw.jpeg",
    "twitter": "BenLesh",
    "mastodon": "",
    "title": "Development Lead",
    "company": "RxJS",
    "talkId": "tug-of-war"
  },
  {
    "edition": 2023,
    "speakerId": "matt-pocock",
    "slug": "matt-pocock",
    "firstname": "Matt",
    "lastname": "Pocock",
    "bio": "<p>Matt is an independent full-stack engineer and developer advocate working on a comprehensive TypeScript course called <a href='https://totaltypescript.com'>Total TypeScript</a>.</p>",
    "image": "speakers/matt_bw.png",
    "twitter": "mattpocockuk",
    "mastodon": "",
    "title": "TypeScript Educator",
    "company": "",
    "talkId": "no-generic"
  },
  {
    "edition": 2023,
    "speakerId": "rachel-andrew",
    "slug": "rachel-andrew",
    "firstname": "Rachel",
    "lastname": "Andrew",
    "bio": "<p>Rachel Andrew lives in Bristol, England. She is a member of the CSS Working Group, where she edits the Multicol and Page Floats specifications. She works for Google as a technical writer and content lead for Chrome Web DevRel, working on <a href='https://web.dev' target='_blank' rel='noopener'>web.dev</a> and the <a href='https://developer.chrome.com/' target='_blank' rel='noopener'>Chrome Developers site</a>.</p> <p>Rachel has been working on the web since 1996 and writing about the web for almost as long. She is the author or co-author of 22 books including <a href='https://abookapart.com/products/the-new-css-layout' target='_blank' rel='noopener'>The New CSS Layout</a>, and a regular contributor to a number of publications both on and offline. Rachel is a frequent speaker at web development and design events.</p> <p>Rachel is a keen distance runner and likes to encourage people to come for a run when attending conferences, with varying degrees of success. She is a student pilot and aviation geek, and recently graduated with a Masters in International Journalism. You can find her on Twitter as <a href='https://twitter.com/rachelandrew' target='_blank' rel='noopener'>@rachelandrew</a> or her blog at <a href='http://rachelandrew.co.uk' target='_blank' rel='noopener'>rachelandrew.co.uk</a></p>",
    "image": "speakers/rachel_bw.jpeg",
    "twitter": "",
    "mastodon": "https://front-end.social/@rachelandrew",
    "title": "Content Lead for Chrome Web Developer Relations",
    "company": "Google",
    "talkId": "css-features-2023"
  },
  {
    "edition": 2023,
    "speakerId": "diana-macau2023",
    "slug": "diana-macau",
    "firstname": "Diana",
    "lastname": "Măcău",
    "bio": "<p>Diana is an IT Recruiter by day and full-time nerd by night. In her free time, she also gets involved in organizing and hosting various events in the local IT community.</p> <p>With more than 10 years of experience in HR and IT Recruitment, strengthened by a background in Organizational & Occupational Health Psychology, Diana believes in the compatibility between what a person is looking for in their next job as well as what a company is searching for in their next employee.</p>",
    "image": "speakers/diana_bw.jpeg",
    "twitter": "DianaMacau",
    "mastodon": "",
    "title": "MC and Host",
    "company": "",
    "talkId": ""
  },
  {
    "edition": 2023,
    "speakerId": "atila-fassina",
    "slug": "atila-fassina",
    "firstname": "Atila",
    "lastname": "Fassina",
    "bio": "Atila is a Developer Relations Engineer and Google Developer Expert. He's been working with the web for over 10 years with multiple stacks and creating content either at conferences, publishing youtube videos, or writing articles.",
    "image": "speakers/atila_bw.jpg",
    "twitter": "AtilaFassina",
    "title": "DevRel Engineer & Educator",
    "company": "",
    "talkId": "rendering-patterns"
  },
  {
    "edition": 2023,
    "speakerId": "erick-wendel",
    "slug": "erick-wendel",
    "firstname": "Erick",
    "lastname": "Wendel",
    "bio": "Erick Wendel is a Node.js Core Team Developer, Keynote Speaker, and professional educator. He's delivered over 100 tech talks in 10+ countries and has been recognized as a Node.js Specialist with awards from Google, Microsoft, and GitHub. With his company <a href='https://erickwendel.com'>erickwendel.com</a>, Erick has trained over 100K people worldwide.",
    "image": "speakers/erik_bw.jpg",
    "twitter": "erickwendel_",
    "title": "Node.js core team member",
    "company": "",
    "talkId": "node-testing-2023"
  },
  {
    "edition": 2023,
    "speakerId": "alex-moldovan2023",
    "slug": "alex-moldovan",
    "firstname": "Alex",
    "lastname": "Moldovan",
    "bio": "Alex is Product Engineer at CodeSandbox, where he mixes his passion for user experience with the interest in creating better tooling for developers. He is also an organizer at JSHeroes, one of the biggest JS/Frontend conferences in Romania.",
    "image": "speakers/alex_bw.jpg",
    "twitter": "alexnmoldovan",
    "title": "Product Engineer",
    "company": "CodeSandbox",
    "talkId": "ethical-choice"
  },
  {
    "edition": 2023,
    "speakerId": "ritvi-mishra",
    "slug": "ritvi-mishra",
    "firstname": "Ritvi",
    "lastname": "Mishra",
    "bio": "Ritvi is a multifaceted artist, maker, and firmware engineer who is passionate about creating beautiful and functional works of art. With a background in IoT and firmware engineering, she brings a unique blend of technical and creative skills to her work. Ritvi is known for her expertise in stained glass art, macrame, and other forms of artistic expression. She runs art workshops that encourage self-expression and creativity, inspiring others to explore their own artistic talents. In her free time, Ritvi has recently become obsessed with scuba diving and other water sports.",
    "image": "speakers/ritvi_bw.jpg",
    "twitter": "frenzyritz13",
    "title": "Developer Advocate",
    "company": "Dyte",
    "talkId": "generative-art"
  },
  {
    "edition": 2023,
    "speakerId": "josh-goldberg",
    "slug": "josh-goldberg",
    "firstname": "Josh",
    "lastname": "Goldberg",
    "bio": "<p>Josh Goldberg is an independent full time open source developer. He works on projects in the TypeScript ecosystem, most notably typescript-eslint: the tooling that enables ESLint and Prettier to run on TypeScript code. Josh is also the author of the O’Reilly Learning TypeScript book, a Microsoft MVP for developer technologies, and an active conference speaker. His personal projects range from static analysis to meta-languages to recreating retro games in the browser. Also cats.</p><a href='https://www.joshuakgoldberg.com/'>joshuakgoldberg.com</a>",
    "image": "speakers/josh_bw.jpg",
    "twitter": "",
    "title": "Open Source Developer",
    "company": "",
    "talkId": "type-safe-css"
  },
  {
    "edition": 2023,
    "speakerId": "benedek-gagyi",
    "slug": "benedek-gagyi",
    "firstname": "Benedek",
    "lastname": "Gagyi",
    "bio": "<p>Developer, teacher, sports-fanatic. In his free time, he's researching the patterns and algorithms connecting basketball, tea, BJJ and drums. His devotion to impeccable and secure user experience is rivaled only by his constant search for the perfect brew of Chinese puerh.</p><a href='https://www.linkedin.com/in/benedek-gagyi'>LinkedIn</a>",
    "image": "speakers/benedek_bw.jpg",
    "twitter": "",
    "title": "Staff Software Engineer",
    "company": "Shopify",
    "talkId": "security-by-design"
  },
  {
    "edition": 2023,
    "speakerId": "ciprian-caba",
    "slug": "ciprian-caba",
    "firstname": "Ciprian",
    "lastname": "Caba",
    "bio": "Born and raised in Timisoara, Ciprian is a full-stack engineer focusing on maximising results with the least amount of effort. Working with early-stage startups, he literally needs to move fast and break things. He embraces change, constantly challenging the status quo and is a strong believer that adaptability is the key for success. Outside work, he's trying to maximise his potential riding his bike, cooking, playing Starcraft and travelling every time he has the chance.",
    "image": "speakers/ciprian_bw.jpg",
    "twitter": "cipriancaba",
    "title": "VP of Engineering",
    "company": "7879",
    "talkId": "ciprian-api"
  },
  {
    "edition": 2019,
    "speakerId": "martin-hochel",
    "slug": "martin-hochel",
    "firstname": "Martin",
    "lastname": "Hochel",
    "bio": "<p>Martin is a Technical Lead for UI and a Google Developer Expert for Web, with a strong passion for JavaScript/TypeScript and clean code. He loves contributing to open source (TypeScript, rex-tils, ng-metadata, @skatejs, React, Preact), enjoys writing technical articles on medium.com and also runs the biggest JavaScript meetup in Prague/CZ - ngParty. Martin loves to travel the world and meet new people at conferences.</p> <p>When he’s not busy preparing the next meetup or talk, you can find him outside, on one of his skate/snow/wakeboards (depends on the weather conditions, yo!)</p>",
    "image": "speakers/martin_hochel.jpg",
    "twitter": "martin_hotell",
    "title": "Principal Engineer",
    "company": "Productboard",
    "talkId": "web-components"
  },
  {
    "edition": 2019,
    "speakerId": "boyan-mihaylov",
    "slug": "boyan-mihaylov",
    "firstname": "Boyan",
    "lastname": "Mihaylov",
    "bio": "Boyan is a software architect and developer, thinking human-first when writing software. He likes experimenting and talking about technology and its application to solving everyday problems. He prefers working solutions over concrete frameworks and languages. Boyan believes technology needs more storytelling and he tries to convey such. In his free time he performs improvised comedy with his group.",
    "image": "speakers/boyan_mihaylov.jpg",
    "twitter": "boyanio",
    "title": "Software Architect and Developer",
    "company": "Fadata",
    "talkId": "web-assembly"
  },
  {
    "edition": 2019,
    "speakerId": "gleb-bahmutov",
    "slug": "gleb-bahmutov",
    "firstname": "Gleb",
    "lastname": "Bahmutov",
    "bio": "<p>Gleb Bahmutov is a JavaScript ninja, image processing expert and software quality fanatic. During the day Gleb is making the web a better place as VP of Engineering at Cypress.io.</p> <p>At night he is fighting software bugs and blogs about it at <a href=\"https://glebbahmutov.com/blog/\">glebbahmutov.com/blog</a>. Microsoft MVP for Open Source Software, you can follow him and his work <a href=\"https://twitter.com/bahmutov\">@bahmutov</a> and find the slides from conference presentations at <a href=\"https://slides.com/bahmutov\">slides.com/bahmutov</a>.</p>",
    "image": "speakers/gleb_bahmutov.jpg",
    "twitter": "bahmutov",
    "title": "VP of Engineering",
    "company": "Cypress.io",
    "talkId": "testing"
  },
  {
    "edition": 2019,
    "speakerId": "raluca-nicola",
    "slug": "raluca-nicola",
    "firstname": "Raluca",
    "lastname": "Nicola",
    "bio": "Raluca works at Esri as a Product Engineer for ArcGIS API for JavaScript. She enjoys prototyping visualizations that involve spatial data. Most of them are in 3D and all of them live on the web. In the past she also made maps for the Atlas of Switzerland and the Swiss National Park.",
    "image": "speakers/raluca_nicola.jpg",
    "twitter": "nicolaraluk",
    "title": "Product Engineer",
    "company": "Esri",
    "talkId": "cartography"
  },
  {
    "edition": 2019,
    "speakerId": "sebastian-witalec",
    "slug": "sebastian-witalec",
    "firstname": "Sebastian",
    "lastname": "Witalec",
    "bio": "Sebastian Witalec is a Senior Developer Advocate for Progress who specialises in Angular and NativeScript. He loves working on both serious and fun projects and one day he will use his robot army to conquer the world.",
    "image": "speakers/sebastian_witalec.png",
    "twitter": "sebawita",
    "title": "Senior Developer Advocate",
    "company": "Progress",
    "talkId": "chat-bots"
  },
  {
    "edition": 2019,
    "speakerId": "katie-koschland",
    "slug": "katie-koschland",
    "firstname": "Katie",
    "lastname": "Koschland",
    "bio": "<p>Katie Koschland is an Engineer and Tech Lead at the Financial Times.</p> <p>She is passionate about web performance and you can find her sharing her thoughts on Twitter at @KKoschland.</p>",
    "image": "speakers/katie_koschland.jpg",
    "twitter": "KKoschland",
    "title": "Engineer",
    "company": "The Financial Times",
    "talkId": "load-testing"
  },
  {
    "edition": 2019,
    "speakerId": "kenneth-auchenberg",
    "slug": "kenneth-auchenberg",
    "firstname": "Kenneth",
    "lastname": "Auchenberg",
    "bio": "<p>Kenneth works at Stripe building the next generation of developer experience(s) and tool(s) for the economic infrastructure of the internet 🌍💰🛠 Previously he worked on @code at Microsoft.</p> <p>He’s the co-founder of @coldfrontconf in Copenhagen, started the @remotedebug initiative, and is a Global Shaper for @wef. He lives in Seattle, USA, and blogs occasionally at <a href=\"https://kenneth.io/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">kenneth.io</a>, and tweets as @auchenberg.</p>",
    "image": "speakers/kenneth_auchenberg.jpg",
    "twitter": "auchenberg",
    "title": "Developer Experience",
    "company": "Stripe",
    "talkId": "devtools"
  },
  {
    "edition": 2019,
    "speakerId": "benedek-gagyi",
    "slug": "benedek-gagyi",
    "firstname": "Benedek",
    "lastname": "Gagyi",
    "bio": "Developer, teacher, sports-fanatic. As a developer, he's working on making the lives of data scientists easier at Cloudera. In his free time, he's researching the patterns and algorithms connecting basketball, tea and drums. His devotion to impeccable and secure user experience is rivaled only by his constant search for the perfect brew of Chinese pu'er.",
    "image": "speakers/benedek_gagyi.jpg",
    "twitter": "BenedekGagyi",
    "title": "Software Engineer",
    "company": "Cloudera",
    "talkId": "xxss"
  },
  {
    "edition": 2019,
    "speakerId": "kenigbolo-meya-stephen",
    "slug": "kenigbolo-meya-stephen",
    "firstname": "Stephen",
    "lastname": "Meya Kenigbolo",
    "bio": "<p>I'm Kenigbolo Meya Stephen, Full Stack Software Engineer working as the Frontend Engineering Team Lead at <a href=\"https://bcaster.com\" target=\"_blank\">BCaster</a>. I'm the Arch Conveyer/Community Manager of CodeAfrique (also now known as Reload for the classroom version), a not-for-profit weekend intensive software engineering bootcamp for underrepresented groups in IT started out first in Estonia.</p> <p>During my free time I sometimes volunteer as an open source developer for <a href=\"https://adsbexchange.com\" target=\"_blank\">ADSBx</a>, spend time playing golf or on the pitch playing/coaching football (soccer, as Americans call it).</p>",
    "image": "speakers/kenigbolo_meya_stephen.jpg",
    "twitter": "expensivestevie",
    "title": "Frontend Engineering Lead",
    "company": "BCaster",
    "talkId": "oss"
  },
  {
    "edition": 2019,
    "speakerId": "titian-cernicova-dragomir",
    "slug": "titian-cernicova-dragomir",
    "firstname": "Tițian",
    "lastname": "Cernicova-Dragomir",
    "bio": "<p>Titian Cernicova-Dragomir is a software engineer with 15 years of experience in C# and 6 years of experience in TypeScript. He is often found on <a href=\"https://stackoverflow.com/users/125734/titian-cernicova-dragomir\" target=\"_blank\">stackoverflow.com</a>, answering TypeScript queries and contributing to the TypeScript compiler.</p> <p>He loves teaching functional programming to first year university students (although he doubts the feeling is always mutual). In his spare time, he enjoys spending time with his wonderful wife and two daughters.</p>",
    "image": "speakers/titian_cernicova_dragomir.png",
    "twitter": "TitianCernicova",
    "title": "Freelance Software Developer",
    "company": "",
    "talkId": "ts"
  },
  {
    "edition": 2019,
    "speakerId": "alex-moldovan",
    "slug": "alex-moldovan",
    "firstname": "Alex",
    "lastname": "Moldovan",
    "bio": "Alex is an Open Source Engineer at teleportHQ and one of the founders of JSHeroes. He is an active voice in the JavaScript community and his mission is to help and inspire others to build an accessible, secure and faster web.",
    "image": "speakers/alex_moldovan.jpg",
    "twitter": "alexnmoldovan",
    "title": "Open Source Engineer",
    "company": "teleportHQ",
    "talkId": "performance"
  },
  {
    "edition": 2019,
    "speakerId": "ruben-restrepo",
    "slug": "ruben-restrepo",
    "firstname": "Ruben",
    "lastname": "Restrepo",
    "bio": "Some friends call me Siri ;) It’s because I know many (useless?) facts, like the name of the inventors of all programming languages and the history behind them. That’s because I’m really curious about knowing the not so obvious things.",
    "image": "speakers/ruben_restrepo.png",
    "twitter": "degrammer",
    "title": "Software Engineer",
    "company": "Auth0",
    "talkId": "auth"
  },
  {
    "edition": 2019,
    "speakerId": "jennifer-wadella",
    "slug": "jennifer-wadella",
    "firstname": "Jennifer",
    "lastname": "Wadella",
    "bio": "<p>Jennifer Wadella has been writing code since before she realized it was a credible career path. She currently works as a JavaScript Consultant and loves building performant web applications, speaking at technical conferences, and brewing kombucha.</p> <p>Jennifer is an active member of the KC tech community and the founder of Kansas City Women in Technology (KCWiT), an organization aimed at growing the number of women in technology careers in Kansas City. She is the PubConf Sydney 2018 Champion, a Silicon Prairie Champion Award Nominee, Rising Trendsetter STEMMy award-winner, and is apparently Missouri's Coolest Woman according to Pure Wow.</p>",
    "image": "speakers/jennifer_wadella.jpg",
    "twitter": "likeOMGitsFEDAY",
    "title": "JavaScript Developer",
    "company": "Bitovi",
    "talkId": "pa11y"
  },
  {
    "edition": 2019,
    "speakerId": "mathieu-henri",
    "slug": "mathieu-henri",
    "firstname": "Mathieu",
    "lastname": "Henri",
    "bio": "At Microsoft, Mathieu works on the Profile card in Office and Office 365, specializing in cross platform automation. Previously he worked 11 years on the Opera browsers. In his spare time, he makes tiny demos in JavaScript and Pico-8 and runs a Code Club with Elementary school children.",
    "image": "speakers/mathieu_henri.png",
    "twitter": "p01",
    "title": "Senior Software Development Engineer",
    "company": "Microsoft",
    "talkId": "e2e"
  },
  {
    "edition": 2019,
    "speakerId": "csaba-patkos",
    "slug": "csaba-patkos",
    "firstname": "Csaba",
    "lastname": "Patkós",
    "bio": "I am code craftsman passionate about code design, architecture, and clean code. I amusing new ideas and latest industry trends in my everyday job. My aim is to make code better, easier to understand, and maintainable for years, not just code and ship.",
    "image": "speakers/csaba_patkos.png",
    "twitter": "PatkosCsaba",
    "title": "Technical Team Lead",
    "company": "Syneto",
    "talkId": "clean-architecture"
  },
  {
    "edition": 2019,
    "speakerId": "kwinten-pisman",
    "slug": "kwinten-pisman",
    "firstname": "Kwinten",
    "lastname": "Pisman",
    "bio": "Kwinten is a frontend architect focused on Angular, with a reactive passion. He shares this passion through blogposts and training sessions with the company he co-founded, called Strongbrew.",
    "image": "speakers/kwinten_pisman.jpg",
    "twitter": "kwintenp",
    "title": "Co-founder and Mentor",
    "company": "Strongbrew",
    "talkId": "angular"
  },
  {
    "edition": 2019,
    "speakerId": "dominic-elm",
    "slug": "dominic-elm",
    "firstname": "Dominic",
    "lastname": "Elm",
    "bio": "Dominic is a GDE for Web Technologies and Angular. He loves RxJS, TypeScript and Machine Learning. He is also a Software Engineer at @StackBlitz and provides high-quality trainings for @thoughtram. Besides work, you will most likely find him outside with his race bike, hiking or climbing.",
    "image": "speakers/dominic_elm.jpg",
    "twitter": "elmd_",
    "title": "Software Engineer",
    "company": "StackBlitz",
    "talkId": "angular"
  },
  {
    "edition": 2019,
    "speakerId": "diana-macau2019",
    "slug": "diana-macau",
    "firstname": "Diana",
    "lastname": "Măcău",
    "bio": "<p>Diana is an IT Recruiter by day and full-time nerd by night. In her free time, she also gets involved in organizing and hosting various events in the local IT community.</p> <p>With more than 7 years of experience in HR and IT Recruitment, strengthened by a background in Organizational & Occupational Health Psychology, Diana believes in the compatibility between what a person is looking for in their next job as well as what a company is searching for in their next employee.</p>",
    "image": "speakers/diana_macau.jpg",
    "twitter": "DianaMacau",
    "title": "MC and Host",
    "company": "",
    "talkId": ""
  }
]
