[
  {
    "id": "martin-hochel",
    "firstname": "Martin",
    "lastname": "Hochel",
    "description": "Martin is a Technical Lead for UI at Twisto.cz and a Google Developer Expert for Web, with a strong passion for JavaScript/TypeScript and clean code. He loves contributing to open source (TypeScript, rex-tils, ng-metadata, @skatejs, React, Preact), enjoys writing technical articles on medium.com and also runs the biggest JavaScript meetup in Prague/CZ - ngParty. Martin loves to travel the world and meet new people at conferences. When he’s not busy preparing the next meetup or talk, you can find him outside, on one of his skate/snow/wakeboards (depends on the weather conditions, yo!)",
    "image": "speakers/martin_hochel.jpg",
    "twitter": "https://twitter.com/martin_hotell",
    "title": "UI Tech Lead",
    "company": "Twisto.cz"
  },
  {
    "id": "carmen-popoviciu",
    "firstname": "Carmen",
    "lastname": "Popoviciu",
    "description": "Carmen is a web developer currently doing all things DevRel at Nulab. She enjoys building things with code and solving programming challenges. She thinks computer engineers are artists of code and is aspiring to one day be the engineering version of Anne Theresa de Keersmaeker. If you want to catch her at the after party, she'll probably be on the dance floor.",
    "image": "speakers/carmen_popoviciu.jpg",
    "twitter": "https://twitter.com/CarmenPopoviciu",
    "title": "Developer Advocate",
    "company": "Nulab"
  },
  {
    "id": "boyan-mihaylov",
    "firstname": "Boyan",
    "lastname": "Mihaylov",
    "description": "Boyan is a software architect and developer, thinking human-first when writing software. He likes experimenting and talking about technology and its application to solving everyday problems. Prefers working solutions over concrete frameworks and languages. Boyan believes technology needs more storytelling and he tries to convey such. In his free time he performs improvised comedy with his group.",
    "image": "speakers/boyan_mihaylov.jpg",
    "twitter": "https://twitter.com/boyanio",
    "title": "Software Architect and Developer",
    "company": "MP Pension"
  },
  {
    "id": "gleb-bahmutov",
    "firstname": "Gleb",
    "lastname": "Bahmutov",
    "description": "Boyan is a software architect and developer, thinking human-first when writing software. He likes experimenting and talking about technology and its application to solving everyday problems. Prefers working solutions over concrete frameworks and languages. Boyan believes technology needs more storytelling and he tries to convey such. In his free time he performs improvised comedy with his group.",
    "image": "speakers/gleb_bahmutov.jpg",
    "twitter": "https://twitter.com/bahmutov",
    "title": "VP of Engineering",
    "company": "Cypress.io"
  },
  {
    "id": "raluca-nicola",
    "firstname": "Raluca",
    "lastname": "Nicola",
    "description": "Raluca works at Esri as a Product Engineer for ArcGIS API for JavaScript. She enjoys prototyping visualizations that involve spatial data. Most of them are in 3D and all of them live on the web. In the past she also made maps for the Atlas of Switzerland and the Swiss National Park.",
    "image": "speakers/raluca_nicola.jpg",
    "twitter": "https://twitter.com/nicolaraluk",
    "title": "Product Engineer",
    "company": "Esri"
  }
]
