[
  {
    "talkId": "web-components",
    "talk": "The (Real) State of Web Components",
    "abstract": "<p>2018 is gonna be the year of Web Components they said... Was it? The year is 2019 and people are asking, are Web Components everywhere? Probably not. Why?</p><p>This talk will try to answer all these questions you might be asking yourself, by going through a real evaluation of Web Components as the primary tool for authoring web pages and applications.</p>",
    "speakers": [{ "speakerId": "martin-hochel" }],
    "edition": 2019,
    "recordingUrl": "https://www.youtube.com/watch?v=mYGEBuq1ppI&list=PL701JjUqw62nHoRho4RJ3KJSLCRG08r1Z",
    "recordingImage": "talks/2019_09.png"
  },
  {
    "talkId": "web-assembly",
    "talk": "A journey of multithreading using WebAssembly",
    "abstract": "<p>WebAssembly is a new programming language, allowing us to compile C/C++ or other statically typed languages and run them in the browser and Node.js. While languages like C/C++ support multi-threading, JavaScript is single-threaded and this raises the question of how WebAssembly will behave.</p> <p>In this talk we will discuss the design of threads for WebAssembly, the implementation challenges in terms of security and we will see examples of how multithreading can be achieved using Web Workers.</p>",
    "speakers": [{ "speakerId": "boyan-mihaylov" }],
    "edition": 2019,
    "recordingUrl": "https://www.youtube.com/watch?v=vc5wHbUfEto&list=PL701JjUqw62nHoRho4RJ3KJSLCRG08r1Z",
    "recordingImage": "talks/2019_15.png"
  },
  {
    "talkId": "testing",
    "talk": "Wait, before you write your next test...",
    "abstract": "This presentation looks at the variety of ways we can test a typical web application. From unit tests to end-to-end, from functional to visual testing, from happy paths to the edge cases - there are a lot of solutions available, and each new technique gives us additional confidence in our application. This presentation will teach you how to guide test writing using code coverage, how to reach into the application code to test edge cases, and how to decide when to stub a network API request and when to let it go through.",
    "speakers": [{ "speakerId": "gleb-bahmutov" }],
    "edition": 2019,
    "recordingUrl": "https://www.youtube.com/watch?v=T_jr0buAZ_Y&list=PL701JjUqw62nHoRho4RJ3KJSLCRG08r1Z",
    "recordingImage": "talks/2019_12.png"
  },
  {
    "talkId": "cartography",
    "talk": "The web developer’s guide to cartography",
    "abstract": "<p>Maps are everywhere! Whether you want to find your hotel, plan your next hike or see the results of a recent election, maps are indispensable.</p> <p>But how do we create such maps? Web mapping APIs have come a long way. They are easy to use and not only allow us to create 2D maps, but more recently also 3D ones. Add some magic geo data and cartographic knowledge and you are on your way to building your first mapping master piece.</p> <p>In this talk we’ll go through the process of creating a web map: starting from an idea, gathering and processing the data, and finishing up with a beautiful web map visualization. No geo-knowledge required! Enthusiasm for maps will be provided in the beginning of the talk.</p>",
    "speakers": [{ "speakerId": "raluca-nicola" }],
    "edition": 2019,
    "recordingUrl": "https://www.youtube.com/watch?v=zsAt5cro_UU&list=PL701JjUqw62nHoRho4RJ3KJSLCRG08r1Z",
    "recordingImage": "talks/2019_04.png"
  },
  {
    "talkId": "chat-bots",
    "talk": "Adopt an AI-driven chatbot today",
    "abstract": "<p>Have you ever asked yourself any of these questions: What do chatbots eat? Do chatbots have dreams? What are the usual chatbot challenges? If so, this talk is for you. We will answer all of the above questions and many more.</p> <p>You will learn how to build a fully functioning chatbot in less than 10 minutes – without a single IF statement – and train it to understand human language. Then we will top it up with a quick AI training to make it understand human language.</p>",
    "speakers": [{ "speakerId": "sebastian-witalec" }],
    "edition": 2019,
    "recordingUrl": "https://www.youtube.com/watch?v=zMeqe0LCin0&list=PL701JjUqw62nHoRho4RJ3KJSLCRG08r1Z",
    "recordingImage": "talks/2019_07.png"
  },
  {
    "talkId": "load-testing",
    "talk": "Ready, steady, crash! ",
    "abstract": "<p>The key to finding the optimal solution to a problem is to threefold: maximise the number of tools in your ‘personal tool box’; know all their capabilities and uses; and to know which tool is best suited to fix the particular problem in front of you.</p> <p>This talk will enable you to grow all three aspects around load testing.</p><p>It will look at what it means to ‘load test’ your application, how to get started with writing your first script and provide you with a case study and an insight as to the tools and techniques that we use here at the FT to help identify such performance issues.</p>",
    "speakers": [{ "speakerId": "katie-koschland" }],
    "edition": 2019,
    "recordingUrl": "https://www.youtube.com/watch?v=GT0V1SucScs&list=PL701JjUqw62nHoRho4RJ3KJSLCRG08r1Z",
    "recordingImage": "talks/2019_11.png"
  },
  {
    "talkId": "devtools",
    "talk": "DevTools for the decade to come",
    "abstract": "The ML revolution is here, and will have a profound impact on the way we develop software, but what does all of this ML buzz mean for front-end and web developers? In this talk I’ll share my perspective on the revolution that’s in front of us, and what it will mean for us as developers, and the developer tools for the decade to come. Buckle up!",
    "speakers": [{ "speakerId": "kenneth-auchenberg" }],
    "edition": 2019,
    "recordingUrl": "https://www.youtube.com/watch?v=FKkHKmevyHE&list=PL701JjUqw62nHoRho4RJ3KJSLCRG08r1Z",
    "recordingImage": "talks/2019_16.png"
  },
  {
    "talkId": "xxss",
    "talk": "XXSS: Exotic Cross-Site Scripting Vectors",
    "abstract": "<p>XSS is one of the most well known attacks on the web, perhaps second only to SQL Injection. While the general idea behind it is relatively simple, due to the colorfulness of the web and the quirks of the browsers, it has a surprising depth to it.</p> <p>In this talk we’ll journey deep down the rabbit hole of XSS attacks and take a look at all the weird ways malicious inputs may hurt our users, from the non-JS based injections (CSS, HTML, image) through mXSS, up to blind XSS.</p>",
    "speakers": [{ "speakerId": "benedek-gagyi" }],
    "edition": 2019,
    "recordingUrl": "https://www.youtube.com/watch?v=cTv2cOm-Zgc&list=PL701JjUqw62nHoRho4RJ3KJSLCRG08r1Z",
    "recordingImage": "talks/2019_13.png"
  },
  {
    "talkId": "oss",
    "talk": "You can do open source!",
    "abstract": "<p>Have you ever felt like open source is too much of a hassle to get into? Ever felt like you do not know enough about programming yet to get into open source? What if I told you that you’re not alone in this thought but that this thought is a misrepresentation of the facts? Join me as we take a deep dive.</p> <p>Both Junior, Intermediate and Senior developers and non-developers very often find themselves mulling over the idea of contributing to open source projects. A lot of the times this is because they might not know how to get started in contributing to open source. They either don’t believe that they are able to contribute or they think that only developers and people who are code gurus can actually contribute to open source. These are all misconceptions and the goal of this talk is to correct those misconceptions as well as give a clear outline about how to go about it for both developers and non-developers.</p>",
    "speakers": [{ "speakerId": "kenigbolo-meya-stephen" }],
    "edition": 2019,
    "recordingUrl": "https://www.youtube.com/watch?v=iwV7HEifUv4&list=PL701JjUqw62nHoRho4RJ3KJSLCRG08r1Z",
    "recordingImage": "talks/2019_08.png"
  },
  {
    "talkId": "ts",
    "talk": "Can I really type THAT in TypeScript!?",
    "abstract": "<p>Have you mastered the basics of TypeScript and are now struggling to type your more complicated code? Want to learn how to remove pesky “any” types from your code base? Then this talk is for you!</p> <p>We will take a journey through the world of advanced TypeScript types (unions, intersections, tuples, mapped types and conditional types) and talk about how you can put them to practical use, with real-world examples from stackoverflow.com.<p>",
    "speakers": [{ "speakerId": "titian-cernicova-dragomir" }],
    "edition": 2019,
    "recordingUrl": "https://www.youtube.com/watch?v=wNsKJMSqtAk&list=PL701JjUqw62nHoRho4RJ3KJSLCRG08r1Z",
    "recordingImage": "talks/2019_02.png"
  },
  {
    "talkId": "performance",
    "talk": "Done in 0.0166666666 seconds",
    "abstract": "In order to ensure a smooth, jank-free experience on the web, we need to render a constant stream of 60 frames per second. This means that the browser has 16 milliseconds to execute our code and render the changes on the screen. Let’s find out how the rendering pipeline works and how JavaScript and CSS might affect the rendering performance.",
    "speakers": [{ "speakerId": "alex-moldovan" }],
    "edition": 2019,
    "recordingUrl": "https://www.youtube.com/watch?v=juTZsOCd3uw&list=PL701JjUqw62nHoRho4RJ3KJSLCRG08r1Z",
    "recordingImage": "talks/2019_03.png"
  },
  {
    "talkId": "auth",
    "talk": "WebAuthn Rocks! Stop authenticating as if it were the 60s",
    "abstract": "<p>In the last year, WebAuthn advanced to a W3C Candidate Recommendation, making a giant leap toward enabling strong authentication on the Web for consumers. Does this mean the end of passwords, or even more phishing?</p> <p>Let’s learn about the JavaScript credential management API and how to enable authentication via WebAuthn on a website.</p>",
    "speakers": [{ "speakerId": "ruben-restrepo" }],
    "edition": 2019,
    "recordingUrl": "https://www.youtube.com/watch?v=S9zlOh7xGms&list=PL701JjUqw62nHoRho4RJ3KJSLCRG08r1Z",
    "recordingImage": "talks/2019_10.png"
  },
  {
    "talkId": "pa11y",
    "talk": "Become an Accessibility BFF with your new friend Pa11y!",
    "abstract": "<p>Like Blair Waldorf and Serena van der Woodsen, Pa11y is an accessibility tester’s BFF. You already have a million issues on your plate, so how do you find a way to get started on accessibility testing? Pa11y to the rescue! Pa11y is a lightweight JS a11y testing tool with some serious “it” factor.</p> <p>This talk will explain what Pa11y does and does not cover, review examples of both command line and scripted usage, dive into the Pa11y web service and show how to best accessorize a Pa11y setup with your current testing process.</p> <p>Bonus content: how to convince the rest of your team and business why accessibility is totally worth prioritizing and how getting started with low-hanging fruit can vastly glamorize your product. Now you can take on creating a more accessible product like S & B take on the Upper East Side.</p> <p>XOXO Accessibility Girl 💋</p>",
    "speakers": [{ "speakerId": "jennifer-wadella" }],
    "edition": 2019,
    "recordingUrl": "https://www.youtube.com/watch?v=S49NKDfIgo0&list=PL701JjUqw62nHoRho4RJ3KJSLCRG08r1Z",
    "recordingImage": "talks/2019_01.png"
  },
  {
    "talkId": "angular",
    "talk": "Hacking the Angular compiler with your own syntax",
    "abstract": "<p>In this duo-talk, Kwinten Pisman and Dominic Elm are going to take us on a deep dive into how Angular transforms components into DOM elements.</p> <p>We will see how we hooked into this process to be able to teach our own template syntax to Angular so we can make our own code more concise and start using some features/APIs we've always wanted.</p> <p>Attendees will walk away with a deep understanding of the Angular compiler and learn an (experimental) way to hack their own syntax into it!</p>",
    "speakers": [
      { "speakerId": "kwinten-pisman" },
      { "speakerId": "dominic-elm" }
    ],
    "edition": 2019,
    "recordingUrl": "https://www.youtube.com/watch?v=zaCYMarOtDE&list=PL701JjUqw62nHoRho4RJ3KJSLCRG08r1Z",
    "recordingImage": "talks/2019_05.png"
  },
  {
    "talkId": "e2e",
    "talk": "End to end testing a world of web, mobile & desktop apps",
    "abstract": "<p>Things get complicated when you target multiple platforms and large parts of your code powers components used on Android, iOS, Mac, Win32 and the web from IE11 and up.</p> <p>This is the testing journey of the Profile card serving +100M people in Outlook and Office 365: How we style, test and monitor our components for any hiccups. And boy do they misbehave at times!</p> <p>Starting with one browser and some open source libraries, we improved the status quo and set a framework that scales our end to end testing across browsers and native applications</p>",
    "speakers": [{ "speakerId": "mathieu-henri" }],
    "edition": 2019,
    "recordingUrl": "https://www.youtube.com/watch?v=qzguvJB3AfY&list=PL701JjUqw62nHoRho4RJ3KJSLCRG08r1Z",
    "recordingImage": "talks/2019_06.png"
  },
  {
    "talkId": "clean-architecture",
    "talk": "Clean Architecture - A Twelve Months Journey to Clarity",
    "abstract": "<p>We believe in change. We believe in proven principles. We believe in choosing the right tool for the job. Come, attend my presentation to get a glimpse at our journey from a monolithic architecture to one driven by Clean Architecture.</p> <p>I will show you how a project changed over the course of a whole year from a monolith written on top of an Express.js structure, and in various plain and messy JavaScript standards, into a modular Clean Architecture driven design and architecture, and with TypeScript.</p> <p>We will talk about modules, adopting TypeScript, extracting microservices from existing code, and of course TDD, unit testing, api testing.</p>",
    "speakers": [{ "speakerId": "csaba-patkos" }],
    "edition": 2019,
    "recordingUrl": "https://www.youtube.com/watch?v=hATkIlJNqi8&list=PL701JjUqw62nHoRho4RJ3KJSLCRG08r1Z",
    "recordingImage": "talks/2019_14.png"
  },
  {
    "talkId": "tug-of-war",
    "talk": "Tug Of War - Pushing and Pulling In JavaScript",
    "abstract": "<p>In this talk we'll explore what 'push' and 'pull' mean as concepts in programming, where you see this in JavaScript, and why it's important. We'll be looking at the differences and similarities in different asynchronous and synchronous interfaces, and talking about some of the pros and cons of each. In this talk I hope to help everyone unlock a new understanding of what's happening in their applications at a lower level, and hopefully start seeing all of their code through the lens of 'push vs pull'.</p>",
    "speakers": [{ "speakerId": "ben-lesh" }],
    "edition": 2023,
    "recordingUrl": "",
    "recordingImage": ""
  },
  {
    "talkId": "async-debugging",
    "talk": "Have You Heard The Joke About Async Debugging? I Promise It Is Good.",
    "abstract": "<p>Asynchronous code is hard to write, debug, and maintain. Most applications also contain unrecognized race conditions, missed resource cleanup, and other bugs. In this talk, Jay will talk through some of the most common examples of async bugs, and how to identify, debug, fix them, and avoid them in the future, regardless of which UI framework you prefer.</p>",
    "speakers": [{ "speakerId": "jay-phelps" }],
    "edition": 2023,
    "recordingUrl": "",
    "recordingImage": ""
  },
  {
    "talkId": "web-beyond-today",
    "talk": "Beyond the web of today",
    "abstract": "<p>At Intel we work on the forefront of innovation as our hardware roadmaps are defined years ahead of release. This means that we need to make sure that the web platform takes advantage of new hardware capabilities as they are released or shortly after. This ranges from enabling new form factors to taking advantage of hardware accelerators.</p> <p>In this talk we will discuss some of the new innovations that Intel is bringing to the web, such as WebNN, which enables access to fast neural network and machine learning capabilities; WebGPU and Compute Pressure, a new API enabling better user experience and bringing adaptive compute capabilities to the client, just like adaptive streaming has improved streaming use-cases by adapting to live network conditions.</p>",
    "speakers": [{ "speakerId": "kenneth-rohde-christiansen" }],
    "edition": 2023,
    "recordingUrl": "",
    "recordingImage": ""
  },
  {
    "talkId": "testing-strategy",
    "talk": "Testing Your Testing Strategy",
    "abstract": "<p>'End-to-end tests are more valuable than unit tests.' 'You should always use Test-Driven Development.' 'Testing helps you release faster.' Testing is often spoken of in sharp truths like these, but the reality for most developers is often a lot more fuzzy. Do these recommendations actually make sense for you?</p><p>In this talk, we’ll take a step back and discuss how you can develop a testing strategy that fits your specific team and project. We’ll question some popular assumptions, talk about criteria to evaluate testing approaches, and give you ideas to make your development workflow more efficient without losing confidence in your software.</p>",
    "speakers": [{ "speakerId": "trent-willis" }],
    "edition": 2023,
    "recordingUrl": "",
    "recordingImage": ""
  },
  {
    "talkId": "bag-of-spanners",
    "talk": "Bag of spanners",
    "abstract": "<p>In the UK we say that something is a 'bag of spanners' when it seems to work, but when you look inside it turns out to be badly implemented.</p><p>Implementing  accessible code can sometimes feel like a bag of spanners - something thrown together in ways that will probably give you (or someone using your product) trouble.</p><p>It doesn't have to be like this though.</p><p>With an understanding of how accessibility mechanics work in the browser, knowledge of how to provide or polyfill accessibility semantics, and a little bit of effort, you can turn your bag of spanners into a useful set of tools.</p>",
    "speakers": [{ "speakerId": "leonie-watson" }],
    "edition": 2023,
    "recordingUrl": "",
    "recordingImage": ""
  },
  {
    "talkId": "performance-tooling",
    "talk": "Demystifying web performance tooling",
    "abstract": "<p>Web performance has been one of the most talked about web development topics in the recent years. Yet if you try to start your journey with the speed optimisations, you might find yourself in a pickle. With the tooling, you might feel overwhelmed—it looks complex and hard to comprehend. With the metrics: at first glance all of them seem similar, not to mention that they change over time and you cannot figure out which of them to take into account.</p><p>In this talk I we will take a look at the most useful web performance tooling. There will be no more secrets around the topic and you will be able to dive into the web speed optimisations with confidence. We will also briefly mention metrics and services to monitor your improvements over time.</p>",
    "speakers": [{ "speakerId": "anna-migas" }],
    "edition": 2023,
    "recordingUrl": "",
    "recordingImage": ""
  },
  {
    "talkId": "css-features-2023",
    "talk": "New CSS features you can use today",
    "abstract": "New CSS features are landing on the web platform at a rate we've never seen before, but is it too early to start to use the latest shiny thing everyone is talking about? In this talk Rachel Andrew will share some of the new features that you can feel confident to use today, and those that are just around the corner. You'll also learn how browsers are working together to make it easier to understand what's available and working well cross-browser.",
    "speakers": [{ "speakerId": "rachel-andrew" }],
    "edition": 2023,
    "recordingUrl": "",
    "recordingImage": ""
  },
  {
    "talkId": "talk2023-martin",
    "talk": "Talk to be announced",
    "abstract": "",
    "speakers": [{ "speakerId": "martin-splitt" }],
    "edition": 2023,
    "recordingUrl": "",
    "recordingImage": ""
  },
  {
    "talkId": "no-generic",
    "talk": "There Is No Such Thing As A 'Generic'",
    "abstract": "<p>When you think of the hardest thing about TypeScript, the word 'generics' comes to mind. Generics feel mystical, impossible to grok - but powerful. Generics are at the heart of TypeScript's most powerful abstractions, from Zod to tRPC to your frontend framework.</p> <p>The truth is that there's no such thing as a 'generic' in TypeScript. There are type arguments, and type parameters. There are generic types. Generic functions. Generic classes. And once you realise that, their power unlocks itself.</p>",
    "speakers": [{ "speakerId": "matt-pocock" }],
    "edition": 2023,
    "recordingUrl": "",
    "recordingImage": ""
  },
  {
    "talkId": "rendering-patterns",
    "talk": "Understanding Rendering Patterns",
    "abstract": "React has exploded in popularity thanks to the performance and unrivaled developer experience the virtual DOM and reconciliation could offer. But as our apps grew, we started pushing the boundaries of managing client state in a performant way. Let's see how to achieve fine-grained reactivity and what resumability brings to the table.",
    "speakers": [{ "speakerId": "atila-fassina" }],
    "edition": 2023,
    "recordingUrl": "",
    "recordingImage": ""
  },
  {
    "talkId": "node-testing-2023",
    "talk": "Node.js in 2023 - What's new in the Node.js native test runner",
    "abstract": "<p>Node.js has been evolving fast. Jest? Mocha? What about using only Node.js without installing any additional libraries?</p><p>Node.js has been receiving a lot of updates to empower you to test, mock and automate repetitive tasks.</p><p>You'll learn by real scenarios the best Node.js test runner can offer and how you can start using it right away</p><p>This talk will cover the following topics:<ul><li>Overview of the Node.js test runner</li><li>How to mock, stub and Spy functions</li><li>How the Node.js' watch mode is working alongside the test runner</li></ul></p>",
    "speakers": [{ "speakerId": "erick-wendel" }],
    "edition": 2023,
    "recordingUrl": "",
    "recordingImage": ""
  },
  {
    "talkId": "ethical-choice",
    "talk": "The Ethical Choice",
    "abstract": "<p>As technology is eating the world and humanity’s dependence on software is growing every day, there is a strong need for ethics to be brought up in product design and engineering.</p><p>No one starts with the intention of building software that is harming others, but unethical actions (or inactions) over time can lead to bad or harmful experiences. The past decade showed us the dangers of ethical fading, when product decisions were made without considering their effects on the world. Think about social media, the attention economy it exploited and its impact when deployed to the scale of the web.</p><p>As developers and designers, we often feel irrelevant in the grand scheme of things. But what if we have more power than we think? And what if the power comes with a level of responsibility we have towards the user or the customers we serve?</p>",
    "speakers": [{ "speakerId": "alex-moldovan2023" }],
    "edition": 2023,
    "recordingUrl": "",
    "recordingImage": ""
  },
  {
    "talkId": "generative-art",
    "talk": "Breaking down Javascript complexities with generative art",
    "abstract": "Are you struggling to wrap your head around complex JavaScript concepts? Have you ever considered using generative art to visualize and simplify these concepts? In this talk, we will explore how generative art can be used to break down complex concepts in JavaScript. You will learn about various tools and libraries for creating generative art, and we will demonstrate live-coding examples to make it all come to life. Join us to discover a creative and engaging approach to understanding JavaScript complexities.",
    "speakers": [{ "speakerId": "ritvi-mishra" }],
    "edition": 2023,
    "recordingUrl": "",
    "recordingImage": ""
  },
  {
    "talkId": "type-safe-css",
    "talk": "Type-Safe Style Systems: The Future of CSS",
    "abstract": "<p>Most CSS developers today write visual styles in terms of what you literally see: exact color values, size numbers, and so on. But what if you could write styles as a function of how they fit into your design system? And what if you could get type safety in specifying and using those values, including in responsive props?</p><p>This talk will dive into some of the key features and flaws in many design system builders today such as Chakra UI and Tailwind. We'll establish what the best next steps for design systems should be with type-safe TypeScript APIs and performance both for prebuilt pages and at runtime.</p>",
    "speakers": [{ "speakerId": "josh-goldberg" }],
    "edition": 2023,
    "recordingUrl": "",
    "recordingImage": ""
  },
  {
    "talkId": "security-by-design",
    "talk": "Security by(e) Design?",
    "abstract": "Application security and UX seem like two very distant fields, but they have a surprisingly large influence over one another. Through this talk we’ll rethink the intricate relationship between these two fields, highlighting how UX designers can unintentionally compromise security and the challenges security engineers face in maintaining a smooth UX. Moreover, we will explore the invaluable insights developers can glean from these challenges, making them better developers and empowering them to serve as bridges between these distinct worlds. Join us as we navigate this convergence of disciplines and unveil practical strategies to harmonise application security and UX, paving the way for enhanced digital experiences.",
    "speakers": [{ "speakerId": "benedek-gagyi" }],
    "edition": 2023,
    "recordingUrl": "",
    "recordingImage": ""
  },
  {
    "talkId": "apis-requiem",
    "talk": "Requiem for APIs - The evolution of web development",
    "abstract": "<p>Finding ways to optimize your web apps is always a complex juggling exercise between user experience and developer convenience. However, for the ones brave enough to embrace the bleeding edge in web development, things are about to get simpler, but not necessarily less sophisticated.</p><p>We will revisit some patterns from the good old days of web development and see how we can blend those with the current technologies, trying to cut the middleman and optimize both the user experience and developer convenience. What is old is new again</p>",
    "speakers": [{ "speakerId": "ciprian-caba" }],
    "edition": 2023,
    "recordingUrl": "",
    "recordingImage": ""
  }
]
